using System.ComponentModel;
using System.ComponentModel.DataAnnotations;
using System.ComponentModel.DataAnnotations.Schema;
using Incom.Common2.Persistence;
using Incom.Entity.Abstractions.Attributes;

namespace Aviales.Model.Aviales
{
	/// <summary>
	/// Инициирование дел об административных правонарушениях и уголовных дел (ЛО, форма 2 ЛО, пункт 2)
	/// </summary>
	[Table("FireSafetyRegulationViolation", Schema = "Aviales")]
	[DisplayName("Инициирование дел об административных правонарушениях и уголовных дел")]
	[Serializable]
	[AssociativeToString("Привлечение к ответственности по: {FirePreventionAndSafetyRegulationViolation}")]
	public class FireSafetyRegulationViolation : AuditModelBase
	{
		/// <summary>
		/// Количество проведенных рейдов, шт.
		/// </summary>
	    [DisplayName("Количество проведенных рейдов, шт.")]
		public int? Raid { get; set; }
		/// <summary>
		/// Выявлено нарушений требований правил пожарной безопасности в лесах, шт.
		/// </summary>
	    [DisplayName("Выявлено нарушений требований правил пожарной безопасности в лесах, шт.")]
		public int? Violation { get; set; }
		/// <summary>
		/// Количество составленных административных протоколов и наложенных административных штрафов в отношении граждан: тыс. руб.
		/// </summary>
	    [DisplayName("Количество составленных административных протоколов и наложенных административных штрафов в отношении граждан: тыс. руб.")]
		public decimal? AdminCitizenCost { get; set; }
		/// <summary>
		/// Количество составленных административных протоколов и наложенных административных штрафов в отношении граждан: единиц
		/// </summary>
	    [DisplayName("Количество составленных административных протоколов и наложенных административных штрафов в отношении граждан: единиц")]
		public int? AdminCitizenCount { get; set; }
		/// <summary>
		/// Количество составленных административных протоколов и наложенных административных штрафов в отношении юридических лиц: тыс. руб.
		/// </summary>
	    [DisplayName("Количество составленных административных протоколов и наложенных административных штрафов в отношении юридических лиц: тыс. руб.")]
		public decimal? AdminJuridicCost { get; set; }
		/// <summary>
		/// Количество составленных административных протоколов и наложенных административных штрафов в отношении юридических лиц: единиц
		/// </summary>
	    [DisplayName("Количество составленных административных протоколов и наложенных административных штрафов в отношении юридических лиц: единиц")]
		public int? AdminJuridicCount { get; set; }
		/// <summary>
		/// Количество составленных административных протоколов и наложенных административных штрафов в отношении должностных лиц: тыс. руб.
		/// </summary>
	    [DisplayName("Количество составленных административных протоколов и наложенных административных штрафов в отношении должностных лиц: тыс. руб.")]
		public decimal? AdminOfficialCost { get; set; }
		/// <summary>
		/// Количество составленных административных протоколов и наложенных административных штрафов в отношении должностных лиц: единиц
		/// </summary>
	    [DisplayName("Количество составленных административных протоколов и наложенных административных штрафов в отношении должностных лиц: единиц")]
		public int? AdminOfficialCount { get; set; }
		/// <summary>
		/// Количество составленных административных протоколов и наложенных административных штрафов по части 1 статьи 8.32 КоАП Российской Федерации: тыс. руб.
		/// </summary>
	    [DisplayName("Количество составленных административных протоколов и наложенных административных штрафов по части 1 статьи 8.32 КоАП Российской Федерации: тыс. руб.")]
		public decimal? AdminPart1Cost { get; set; }
		/// <summary>
		/// Количество составленных административных протоколов и наложенных административных штрафов по части 1 статьи 8.32 КоАП Российской Федерации: единиц
		/// </summary>
	    [DisplayName("Количество составленных административных протоколов и наложенных административных штрафов по части 1 статьи 8.32 КоАП Российской Федерации: единиц")]
		public int? AdminPart1Count { get; set; }
		/// <summary>
		/// Количество составленных административных протоколов и наложенных административных штрафов по части 2 статьи 8.32 КоАП Российской Федерации: тыс. руб.
		/// </summary>
	    [DisplayName("Количество составленных административных протоколов и наложенных административных штрафов по части 2 статьи 8.32 КоАП Российской Федерации: тыс. руб.")]
		public decimal? AdminPart2Cost { get; set; }
		/// <summary>
		/// Количество составленных административных протоколов и наложенных административных штрафов по части 2 статьи 8.32 КоАП Российской Федерации: единиц
		/// </summary>
	    [DisplayName("Количество составленных административных протоколов и наложенных административных штрафов по части 2 статьи 8.32 КоАП Российской Федерации: единиц")]
		public int? AdminPart2Count { get; set; }
		/// <summary>
		/// Количество составленных административных протоколов и наложенных административных штрафов по части 3 статьи 8.32 КоАП Российской Федерации: тыс. руб.
		/// </summary>
	    [DisplayName("Количество составленных административных протоколов и наложенных административных штрафов по части 3 статьи 8.32 КоАП Российской Федерации: тыс. руб.")]
		public decimal? AdminPart3Cost { get; set; }
		/// <summary>
		/// Количество составленных административных протоколов и наложенных административных штрафов по части 3 статьи 8.32 КоАП Российской Федерации: единиц
		/// </summary>
	    [DisplayName("Количество составленных административных протоколов и наложенных административных штрафов по части 3 статьи 8.32 КоАП Российской Федерации: единиц")]
		public int? AdminPart3Count { get; set; }
		/// <summary>
		/// Количество составленных административных протоколов и наложенных административных штрафов по части 4 статьи 8.32 КоАП Российской Федерации: тыс. руб.
		/// </summary>
	    [DisplayName("Количество составленных административных протоколов и наложенных административных штрафов по части 4 статьи 8.32 КоАП Российской Федерации: тыс. руб.")]
		public decimal? AdminPart4Cost { get; set; }
		/// <summary>
		/// Количество составленных административных протоколов и наложенных административных штрафов по части 4 статьи 8.32 КоАП Российской Федерации: единиц
		/// </summary>
	    [DisplayName("Количество составленных административных протоколов и наложенных административных штрафов по части 4 статьи 8.32 КоАП Российской Федерации: единиц")]
		public int? AdminPart4Count { get; set; }
		/// <summary>
		/// Количество составленных административных протоколов и наложенных административных штрафов по статье 8.32 КоАП Российской Федерации, ед.
		/// </summary>
	    [DisplayName("Количество составленных административных протоколов и наложенных административных штрафов по статье 8.32 КоАП Российской Федерации, ед.")]
		public int? AdminTotalCount { get; set; }
		/// <summary>
		/// Направлено материалов для принятия решения в компетентные органы, ед.
		/// </summary>
	    [DisplayName("Направлено материалов для принятия решения в компетентные органы, ед.")]
		public int? CompetMaterial { get; set; }
		/// <summary>
		/// Возмещено вреда добровольно на сумму, тыс. руб.
		/// </summary>
	    [DisplayName("Возмещено вреда добровольно на сумму, тыс. руб.")]
		public decimal? CompensVolunt { get; set; }
		/// <summary>
		/// Обжаловано отказов в возбуждении уголовных дел из материалов, направленных для принятия решения в компетентные органы, ед.
		/// </summary>
	    [DisplayName("Обжаловано отказов в возбуждении уголовных дел из материалов, направленных для принятия решения в компетентные органы, ед.")]
		public int? CompetAppeal { get; set; }
		/// <summary>
		/// Возбуждено уголовных дел по результатам обжалования из материалов, направленных для принятия решения в компетентные органы, ед.
		/// </summary>
	    [DisplayName("Возбуждено уголовных дел по результатам обжалования из материалов, направленных для принятия решения в компетентные органы, ед.")]
		public int? CompetAppealResult { get; set; }
		/// <summary>
		/// Возбуждено уголовных дел из материалов, направленных для принятия решения в компетентные органы, ед.
		/// </summary>
	    [DisplayName("Возбуждено уголовных дел из материалов, направленных для принятия решения в компетентные органы, ед.")]
		public int? CompetCriminalCase { get; set; }
		/// <summary>
		/// Возбуждено уголовных дел по части 3 статьи 261 Уголовного Кодекса Российской Федерации из материалов, направленных для принятия решения в компетентные органы, ед.
		/// </summary>
	    [DisplayName("Возбуждено уголовных дел по части 3 статьи 261 Уголовного Кодекса Российской Федерации из материалов, направленных для принятия решения в компетентные органы, ед.")]
		public int? CompetCriminalPart3Count { get; set; }
		/// <summary>
		/// Возбуждено уголовных дел по части 4 статьи 261 Уголовного Кодекса Российской Федерации из материалов, направленных для принятия решения в компетентные органы, ед.
		/// </summary>
	    [DisplayName("Возбуждено уголовных дел по части 4 статьи 261 Уголовного Кодекса Российской Федерации из материалов, направленных для принятия решения в компетентные органы, ед.")]
		public int? CompetCriminalPart4Count { get; set; }
		/// <summary>
		/// Отказано в возбуждении уголовных дел из материалов, направленных для принятия решения в компетентные органы, ед.
		/// </summary>
	    [DisplayName("Отказано в возбуждении уголовных дел из материалов, направленных для принятия решения в компетентные органы, ед.")]
		public int? CompetDeny { get; set; }
		/// <summary>
		/// Количество лиц, понесших наказание из материалов, направленных для принятия решения в компетентные органы, чел.
		/// </summary>
	    [DisplayName("Количество лиц, понесших наказание из материалов, направленных для принятия решения в компетентные органы, чел.")]
		public int? CompetPunishPerson { get; set; }
		/// <summary>
		/// Возмещено вреда, по решению суда, на сумму, тыс. руб.
		/// </summary>
	    [DisplayName("Возмещено вреда, по решению суда, на сумму, тыс. руб.")]
		public decimal? CourtDecision { get; set; }
		/// <summary>
		/// Отказано судом в возмещении вреда на сумму, тыс. руб.
		/// </summary>
	    [DisplayName("Отказано судом в возмещении вреда на сумму, тыс. руб.")]
		public decimal? CourtDeny { get; set; }
		/// <summary>
		/// Направлено в суды исков о возмещении вреда в суды на сумму, тыс. руб.
		/// </summary>
	    [DisplayName("Направлено в суды исков о возмещении вреда в суды на сумму, тыс. руб.")]
		public decimal? CourtDirect { get; set; }
		/// <summary>
		/// Присуждено судом возмещение вреда на сумму, тыс. руб.
		/// </summary>
	    [DisplayName("Присуждено судом возмещение вреда на сумму, тыс. руб.")]
		public decimal? CourtOrder { get; set; }
		/// <summary>
		/// Обжаловано отказов в возбуждении уголовных дел из материалов, направленных в органы дознания, ед.
		/// </summary>
	    [DisplayName("Обжаловано отказов в возбуждении уголовных дел из материалов, направленных в органы дознания, ед.")]
		public int? InquiryAppeal { get; set; }
		/// <summary>
		/// Возбуждено уголовных дел по результатам обжалования из материалов, направленных в органы дознания, ед.
		/// </summary>
	    [DisplayName("Возбуждено уголовных дел по результатам обжалования из материалов, направленных в органы дознания, ед.")]
		public int? InquiryAppealResult { get; set; }
		/// <summary>
		/// Возбуждено уголовных дел из материалов, направленных в органы дознания, ед.
		/// </summary>
	    [DisplayName("Возбуждено уголовных дел из материалов, направленных в органы дознания, ед.")]
		public int? InquiryCriminalCase { get; set; }
		/// <summary>
		/// Возбуждено уголовных дел по части 1 статьи 261 Уголовного Кодекса Российской Федерации из материалов, направленных в органы дознания, ед.
		/// </summary>
	    [DisplayName("Возбуждено уголовных дел по части 1 статьи 261 Уголовного Кодекса Российской Федерации из материалов, направленных в органы дознания, ед.")]
		public int? InquiryCriminalPart1Count { get; set; }
		/// <summary>
		/// Возбуждено уголовных дел по части 2 статьи 261 Уголовного Кодекса Российской Федерации из материалов, направленных в органы дознания, ед.
		/// </summary>
	    [DisplayName("Возбуждено уголовных дел по части 2 статьи 261 Уголовного Кодекса Российской Федерации из материалов, направленных в органы дознания, ед.")]
		public int? InquiryCriminalPart2Count { get; set; }
		/// <summary>
		/// Отказано в возбуждении уголовных дел из материалов, направленных в органы дознания, ед.
		/// </summary>
	    [DisplayName("Отказано в возбуждении уголовных дел из материалов, направленных в органы дознания, ед.")]
		public int? InquiryDeny { get; set; }
		/// <summary>
		/// Направлено материалов в органы дознания федеральной противопожарной службы, единиц
		/// </summary>
	    [DisplayName("Направлено материалов в органы дознания федеральной противопожарной службы, единиц")]
		public int? InquiryMaterial { get; set; }
		/// <summary>
		/// Количество лиц, понесших наказание из материалов, направленных в органы дознания, чел.
		/// </summary>
	    [DisplayName("Количество лиц, понесших наказание из материалов, направленных в органы дознания, чел.")]
		public int? InquiryPunishPerson { get; set; }
		/// <summary>
		/// Предъявлено исков о возмещении вреда, причиненного лесам, вследствие нарушения лесного законодательства на сумму, тыс. руб.
		/// </summary>
	    [DisplayName("Предъявлено исков о возмещении вреда, причиненного лесам, вследствие нарушения лесного законодательства на сумму, тыс. руб.")]
		public decimal? TortAction { get; set; }
        /// <summary>
        /// Ключ на родителя <see cref="FirePreventionAndSafetyRegulationViolation"/>, где можно узнать о дате, подтверждении и регионе
        /// </summary>
        [Key]
        [ForeignKey("FirePreventionAndSafetyRegulationViolation")]
	    [DisplayName("Идентификатор отчета")]
        public Guid FirePreventionAndSafetyRegulationViolationId { get; set; }
		
		public virtual FirePreventionAndSafetyRegulationViolation FirePreventionAndSafetyRegulationViolation { get; set; } = null!;

        public override string ToAuditString()
        {
            return "Привлечение к ответственности";
        }
        /*
		/// <summary>
		/// Подтвреждено ФДС
		/// </summary>
		public bool IsConfirmed { get; set; }
		/// <summary>
		/// Идентификатор региона
		/// </summary>
		public Guid RegionId { get; set; }
		/// <summary>
		/// Дата
		/// </summary>
		public DateTime FireSafetyRegulationViolationDate { get; set; }

		[ForeignKey("RegionId")]
		public virtual Region Region { get; set; }
*/
	}
}