using System.ComponentModel;
using System.ComponentModel.DataAnnotations;
using System.ComponentModel.DataAnnotations.Schema;
using Incom.Common2.Persistence;
using Incom.Entity.Abstractions.Attributes;

namespace Aviales.Model.Aviales
{
	/// <summary>
	/// Противопожарные мероприятия (ЛО, форма 2 ЛО, пункт 1)
	/// </summary>
	[Table("FirePrevention", Schema = "Aviales")]
	[DisplayName("Противопожарные мероприятия")]
	[Serializable]
	[AssociativeToString("Противопожарные мероприятия по: {FirePreventionAndSafetyRegulationViolation}")]
	public class FirePrevention : AuditModelBase
	{
		/// <summary>
		/// Подготовлено к работе специализированных организаций по тушению лесных пожаров, в т.ч., авиационных лесопожарных формирований, единиц (Факт)
		/// </summary>
		[DisplayName("Подготовлено к работе специализированных организаций по тушению лесных пожаров, в т.ч., авиационных лесопожарных формирований, единиц (Факт)")]
		public int? AviaFormFact { get; set; }
		/// <summary>
		/// Подготовлено к работе специализированных организаций по тушению лесных пожаров, в т.ч., авиационных лесопожарных формирований, единиц (План)
		/// </summary>
		[DisplayName("Подготовлено к работе специализированных организаций по тушению лесных пожаров, в т.ч., авиационных лесопожарных формирований, единиц (План)")]
		public int? AviaFormPlan { get; set; }
		/// <summary>
		/// Подготовлено к работе специализированных организаций по тушению лесных пожаров, в т.ч. авиационных групп, единиц
		/// </summary>
		[DisplayName("Подготовлено к работе специализированных организаций по тушению лесных пожаров, в т.ч. авиационных групп, единиц")]
		public int? AviaGroupFact { get; set; }
		/// <summary>
		/// Подготовлено к работе специализированных организаций по тушению лесных пожаров, в т.ч. авиационных групп, единиц
		/// </summary>
		[DisplayName("Подготовлено к работе специализированных организаций по тушению лесных пожаров, в т.ч. авиационных групп, единиц")]
		public int? AviaGroupPlan { get; set; }
		/// <summary>
		/// В том числе подготовлено руководителей тушения крупных лесных пожаров, человек
		/// </summary>
		[DisplayName("В том числе подготовлено руководителей тушения крупных лесных пожаров, человек")]
		public int? BigFireFightLeaderFact { get; set; }
		/// <summary>
		/// В том числе подготовлено руководителей тушения крупных лесных пожаров, человек
		/// </summary>
		[DisplayName("В том числе подготовлено руководителей тушения крупных лесных пожаров, человек")]
		public int? BigFireFightLeaderPlan { get; set; }
		/// <summary>
		/// В том числе подготовлено руководителей тушения крупных лесных пожаров, использующих леса, человек
		/// </summary>
		[DisplayName("В том числе подготовлено руководителей тушения крупных лесных пожаров, использующих леса, человек")]
		public int? BigFireFightLeaderUseForestFact { get; set; }
		/// <summary>
		/// В том числе подготовлено руководителей тушения крупных лесных пожаров, использующих леса, человек
		/// </summary>
		[DisplayName("В том числе подготовлено руководителей тушения крупных лесных пожаров, использующих леса, человек")]
		public int? BigFireFightLeaderUseForestPlan { get; set; }
		/// <summary>
		/// Подготовлено руководителей тушения  лесных пожаров, человек
		/// </summary>
		[DisplayName("Подготовлено руководителей тушения  лесных пожаров, человек")]
		public int? FightLeaderFact { get; set; }
		/// <summary>
		/// Подготовлено руководителей тушения  лесных пожаров, человек
		/// </summary>
		[DisplayName("Подготовлено руководителей тушения  лесных пожаров, человек")]
		public int? FightLeaderPlan { get; set; }
		/// <summary>
		/// Подготовлено руководителей тушения  лесных пожаров, в. т.ч. лиц, использующих леса, человек
		/// </summary>
		[DisplayName("Подготовлено руководителей тушения  лесных пожаров, в. т.ч. лиц, использующих леса, человек")]
		public int? FightLeaderUseForestFact { get; set; }
		/// <summary>
		/// Подготовлено руководителей тушения  лесных пожаров, в. т.ч. лиц, использующих леса, человек
		/// </summary>
		[DisplayName("Подготовлено руководителей тушения  лесных пожаров, в. т.ч. лиц, использующих леса, человек")]
		public int? FightLeaderUseForestPlan { get; set; }
		/// <summary>
		/// Подготовлено работников по тактике и технике тушения лесных пожаров, человек
		/// </summary>
		[DisplayName("Подготовлено работников по тактике и технике тушения лесных пожаров, человек")]
		public int? FightTacticWorkerFact { get; set; }
		/// <summary>
		/// Подготовлено работников по тактике и технике тушения лесных пожаров, человек
		/// </summary>
		[DisplayName("Подготовлено работников по тактике и технике тушения лесных пожаров, человек")]
		public int? FightTacticWorkerPlan { get; set; }
		/// <summary>
		/// Подготовлено работников по тактике и технике тушения лесных пожаров, в том числе лиц, использующих леса, человек
		/// </summary>
		[DisplayName("Подготовлено работников по тактике и технике тушения лесных пожаров, в том числе лиц, использующих леса, человек")]
		public int? FightTacticWorkerUseForestFact { get; set; }
		/// <summary>
		/// Подготовлено работников по тактике и технике тушения лесных пожаров, в том числе лиц, использующих леса, человек
		/// </summary>
		[DisplayName("Подготовлено работников по тактике и технике тушения лесных пожаров, в том числе лиц, использующих леса, человек")]
		public int? FightTacticWorkerUseForestPlan { get; set; }
		/// <summary>
		/// Численность задействованных на тушении пожара – всего, человек
		/// </summary>
		[DisplayName("Численность задействованных на тушении пожара – всего, человек")]
		public int? FightWorkerFact { get; set; }
		/// <summary>
		/// Численность задействованных на тушении пожара – всего, человек
		/// </summary>
		[DisplayName("Численность задействованных на тушении пожара – всего, человек")]
		public int? FightWorkerPlan { get; set; }
		/// <summary>
		/// Подготовлено к работе специализированных организаций по тушению лесных пожаров, в т.ч. пожарно-химических станций, единиц
		/// </summary>
		[DisplayName("Подготовлено к работе специализированных организаций по тушению лесных пожаров, в т.ч. пожарно-химических станций, единиц")]
		public int? FireFightChemStationFact { get; set; }
		/// <summary>
		/// Подготовлено к работе специализированных организаций по тушению лесных пожаров, в т.ч. пожарно-химических станций, единиц
		/// </summary>
		[DisplayName("Подготовлено к работе специализированных организаций по тушению лесных пожаров, в т.ч. пожарно-химических станций, единиц")]
		public int? FireFightChemStationPlan { get; set; }
		/// <summary>
		/// Создание запаса горюче-смазочных материалов, тонн
		/// </summary>
		[DisplayName("Создание запаса горюче-смазочных материалов, тонн")]
		public decimal? FuelsLubricantFact { get; set; }
		/// <summary>
		/// Создание запаса горюче-смазочных материалов, в т.ч. авиационных горюче-смазочных материалов, тонн
		/// </summary>
		[DisplayName("Создание запаса горюче-смазочных материалов, в т.ч. авиационных горюче-смазочных материалов, тонн")]
		public decimal? FuelsLubricantFactAvia { get; set; }
		/// <summary>
		/// Создание запаса горюче-смазочных материалов, тонн
		/// </summary>
		[DisplayName("Создание запаса горюче-смазочных материалов, тонн")]
		public decimal? FuelsLubricantPlan { get; set; }
		/// <summary>
		/// Создание запаса горюче-смазочных материалов, в т.ч. авиационных горюче-смазочных материалов, тонн
		/// </summary>
		[DisplayName("Создание запаса горюче-смазочных материалов, в т.ч. авиационных горюче-смазочных материалов, тонн")]
		public decimal? FuelsLubricantPlanAvia { get; set; }
		/// <summary>
		/// Численность задействованных на тушении пожара, в т.ч. работников наземных лесопожарных формирований, человек
		/// </summary>
		[DisplayName("Численность задействованных на тушении пожара, в т.ч. работников наземных лесопожарных формирований, человек")]
		public int? LandFormFact { get; set; }
		/// <summary>
		/// Численность задействованных на тушении пожара, в т.ч. работников наземных лесопожарных формирований, человек
		/// </summary>
		[DisplayName("Численность задействованных на тушении пожара, в т.ч. работников наземных лесопожарных формирований, человек")]
		public int? LandFormPlan { get; set; }
		/// <summary>
		/// Подготовлено к работе специализированных организаций по тушению лесных пожаров, в т.ч. механизированных отрядов, единиц
		/// </summary>
		[DisplayName("Подготовлено к работе специализированных организаций по тушению лесных пожаров, в т.ч. механизированных отрядов, единиц")]
		public int? MechanizUnitFact { get; set; }
		/// <summary>
		/// Подготовлено к работе специализированных организаций по тушению лесных пожаров, в т.ч. механизированных отрядов, единиц
		/// </summary>
		[DisplayName("Подготовлено к работе специализированных организаций по тушению лесных пожаров, в т.ч. механизированных отрядов, единиц")]
		public int? MechanizUnitPlan { get; set; }
		/// <summary>
		/// Организовано мобильных групп пожаротушения – количество всего, единиц
		/// </summary>
		[DisplayName("Организовано мобильных групп пожаротушения – количество всего, единиц")]
		public int? MobileGroupAmountFact { get; set; }
		/// <summary>
		/// Организовано мобильных групп пожаротушения – количество всего, единиц
		/// </summary>
		[DisplayName("Организовано мобильных групп пожаротушения – количество всего, единиц")]
		public int? MobileGroupAmountPlan { get; set; }
		/// <summary>
		/// Организовано мобильных групп пожаротушения – численность всего, человек
		/// </summary>
		[DisplayName("Организовано мобильных групп пожаротушения – численность всего, человек")]
		public int? MobileGroupCountFact { get; set; }
		/// <summary>
		/// Организовано мобильных групп пожаротушения – численность всего, человек
		/// </summary>
		[DisplayName("Организовано мобильных групп пожаротушения – численность всего, человек")]
		public int? MobileGroupCountPlan { get; set; }
		/// <summary>
		/// В т.ч. организовано мобильных групп пожаротушения с привлечением лиц, использующих леса – количество всего, единиц
		/// </summary>
		[DisplayName("В т.ч. организовано мобильных групп пожаротушения с привлечением лиц, использующих леса – количество всего, единиц")]
		public int? MobileGroupUseForestAmountFact { get; set; }
		/// <summary>
		/// В т.ч. организовано мобильных групп пожаротушения с привлечением лиц, использующих леса – количество всего, единиц
		/// </summary>
		[DisplayName("В т.ч. организовано мобильных групп пожаротушения с привлечением лиц, использующих леса – количество всего, единиц")]
		public int? MobileGroupUseForestAmountPlan { get; set; }
		/// <summary>
		/// В т.ч. организовано мобильных групп пожаротушения с привлечением лиц, использующих леса – численность всего, человек
		/// </summary>
		[DisplayName("В т.ч. организовано мобильных групп пожаротушения с привлечением лиц, использующих леса – численность всего, человек")]
		public int? MobileGroupUseForestCountFact { get; set; }
		/// <summary>
		/// В т.ч. организовано мобильных групп пожаротушения с привлечением лиц, использующих леса – численность всего, человек
		/// </summary>
		[DisplayName("В т.ч. организовано мобильных групп пожаротушения с привлечением лиц, использующих леса – численность всего, человек")]
		public int? MobileGroupUseForestCountPlan { get; set; }
		/// <summary>
		/// Численность задействованных на тушении пожара, в т.ч. летчиков-наблюдателей, человек
		/// </summary>
		[DisplayName("Численность задействованных на тушении пожара, в т.ч. летчиков-наблюдателей, человек")]
		public int? ObserverPilotFact { get; set; }
		/// <summary>
		/// Численность задействованных на тушении пожара, в т.ч. летчиков-наблюдателей, человек
		/// </summary>
		[DisplayName("Численность задействованных на тушении пожара, в т.ч. летчиков-наблюдателей, человек")]
		public int? ObserverPilotPlan { get; set; }
		/// <summary>
		/// Подготовлено к работе специализированных организаций по тушению лесных пожаров, в т.ч. иных подразделений, единиц
		/// </summary>
		[DisplayName("Подготовлено к работе специализированных организаций по тушению лесных пожаров, в т.ч. иных подразделений, единиц")]
		public int? OtherUnitFact { get; set; }
		/// <summary>
		/// Подготовлено к работе специализированных организаций по тушению лесных пожаров, в т.ч. иных подразделений, единиц
		/// </summary>
		[DisplayName("Подготовлено к работе специализированных организаций по тушению лесных пожаров, в т.ч. иных подразделений, единиц")]
		public int? OtherUnitPlan { get; set; }
		/// <summary>
		/// Численность задействованных на тушении пожара, в т.ч. парашютистов-пожарных, человек
		/// </summary>
		[DisplayName("Численность задействованных на тушении пожара, в т.ч. парашютистов-пожарных, человек")]
		public int? ParachutistFact { get; set; }
		/// <summary>
		/// Численность задействованных на тушении пожара, в т.ч. парашютистов-пожарных, человек
		/// </summary>
		[DisplayName("Численность задействованных на тушении пожара, в т.ч. парашютистов-пожарных, человек")]
		public int? ParachutistPlan { get; set; }
		/// <summary>
		/// Численность задействованных на тушении пожара, в т.ч. десантников-пожарных, человек
		/// </summary>
		[DisplayName("Численность задействованных на тушении пожара, в т.ч. десантников-пожарных, человек")]
		public int? ParatrooperFact { get; set; }
		/// <summary>
		/// Численность задействованных на тушении пожара, в т.ч. десантников-пожарных, человек
		/// </summary>
		[DisplayName("Численность задействованных на тушении пожара, в т.ч. десантников-пожарных, человек")]
		public int? ParatrooperPlan { get; set; }
		/// <summary>
		/// Подготовлено к работе специализированных организаций по тушению лесных пожаров, единиц
		/// </summary>
		[DisplayName("Подготовлено к работе специализированных организаций по тушению лесных пожаров, единиц")]
		public int? SpecialOrganFact { get; set; }
		/// <summary>
		/// Подготовлено к работе специализированных организаций по тушению лесных пожаров, единиц
		/// </summary>
		[DisplayName("Подготовлено к работе специализированных организаций по тушению лесных пожаров, единиц")]
		public int? SpecialOrganPlan { get; set; }

        /// <summary>
        /// Ключ на родителя <see cref="FirePreventionAndSafetyRegulationViolation"/>, где можно узнать о дате, подтверждении и регионе
        /// </summary>
        [Key]
        [ForeignKey("FirePreventionAndSafetyRegulationViolation")]
        [DisplayName("Идентификатор отчета")]
        public Guid FirePreventionAndSafetyRegulationViolationId { get; set; }

		public virtual FirePreventionAndSafetyRegulationViolation FirePreventionAndSafetyRegulationViolation { get; set; } = null!;
        
        public override string ToAuditString()
        {
            return "Противопожарные мероприятия";
        }
/*
				/// <summary>
				/// Подтвреждено ФДС
				/// </summary>
				public bool IsConfirmed { get; set; }

				/// <summary>
				/// Дата
				/// </summary>
				public DateTime FirePreventionDate { get; set; }

				/// <summary>
				/// Идентификатор региона
				/// </summary>
				public Guid RegionId { get; set; }

				[ForeignKey("RegionId")]
				public virtual Region Region { get; set; }
		*/

	}
}