/****************************************************************************
*  Copyright (C) 2024 Инком. Все права защищены.
*
*  Файл: IMeteostationLinkObject.cs
*  Автор: Анохин А.Ю.
*  Дата создания: 2024-02-27
*  Назначение: “Интерфейс для связки метеостанции с объектом”
****************************************************************************/

namespace Aviales.Model.Interfaces
{
    /// <summary>
    /// Интерфейс. Связка метеостанция с объектом(лесничеством, авиаотделением, муниципальным районом)
    /// </summary>
    public interface IMeteostationLinkObject
    {
        /// <summary>
        /// Идентификатор метеостанции
        /// </summary>
        Guid MeteostationId { get; set; }

        /// <summary>
        /// Вес метеостанции в объекте
        /// </summary>
        decimal? Weight { get; set; }
	}
}
