using System.ComponentModel;

namespace Aviales.Model.Enums
{
	public enum ThreatCriteria : byte
	{
		#region Муниципального характера

		[Description("Не локализованы два и более крупных лесных пожара и не закрыты решением комиссии по ЧС")]
		MultipleUncontainedLargeFires = 0,

		[Description("Не локализован крупный лесной пожар, находящийся в пределах 5-километровой зоны вокруг населенного пункта или объекта инфраструктуры")]
		UncontainedFireNearSettlement = 1,

		[Description("На тушение лесных пожаров привлечено более 50% лесопожарных формирований, пожарной техники и оборудования, предусмотренных планом тушения лесных пожаров соответствующих лесничеств, а также более 50% резерва, предусмотренного сводным планом тушения лесных пожаров на территории субъекта РФ")]
		Over50PercentResourcesEngaged = 2,

		#endregion

		#region Регионального характера

		[Description("Чрезвычайная ситуация в лесах муниципального характера введена на территории 2 и более муниципальных районов, муниципальных или городских округов")]
		EmergencyInMultipleDistricts = 3,

		[Description("Для тушения лесных пожаров задействовано совокупно более 70% лесопожарных формирований, пожарной техники и оборудования, предусмотренных сводным планом тушения лесных пожаров на территории субъекта Российской Федерации")]
		Over70PercentRegionalResourcesEngaged = 4,

		[Description("Не локализован крупный лесной пожар на особо охраняемой природной территории федерального значения, действующий более 3 суток с момента обнаружения, в том числе с применением космических средств")]
		UncontainedFireInProtectedAreaFor3Days = 5,

		#endregion

		[Description("Не ликвидирован пожар в радиусе мониторинга уязвимого объекта")]
		FireNearVulnerableObject = 6
	}
}
